Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ1024EFG124.PIC
      <edc:SFRDef edc:_addr="0x1F860710" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="TRISH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff3773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------11-111-111--11" edc:name="TRISH" edc:nzwidth="0x20" edc:por="------------------11-111-111--11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISH0" edc:desc="" edc:mask="0x1" edc:name="TRISH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH1" edc:desc="" edc:mask="0x1" edc:name="TRISH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISH4" edc:desc="" edc:mask="0x1" edc:name="TRISH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH5" edc:desc="" edc:mask="0x1" edc:name="TRISH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH6" edc:desc="" edc:mask="0x1" edc:name="TRISH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISH8" edc:desc="" edc:mask="0x1" edc:name="TRISH8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISH9" edc:desc="" edc:mask="0x1" edc:name="TRISH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISH10" edc:desc="" edc:mask="0x1" edc:name="TRISH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISH12" edc:desc="" edc:mask="0x1" edc:name="TRISH12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISH13" edc:desc="" edc:mask="0x1" edc:name="TRISH13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860720" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="PORTH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff3773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx-xxx-xxx--xx" edc:name="PORTH" edc:nzwidth="0x20" edc:por="------------------xx-xxx-xxx--xx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RH0" edc:desc="" edc:mask="0x1" edc:name="RH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH1" edc:desc="" edc:mask="0x1" edc:name="RH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RH4" edc:desc="" edc:mask="0x1" edc:name="RH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH5" edc:desc="" edc:mask="0x1" edc:name="RH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH6" edc:desc="" edc:mask="0x1" edc:name="RH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RH8" edc:desc="" edc:mask="0x1" edc:name="RH8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RH9" edc:desc="" edc:mask="0x1" edc:name="RH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RH10" edc:desc="" edc:mask="0x1" edc:name="RH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RH12" edc:desc="" edc:mask="0x1" edc:name="RH12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RH13" edc:desc="" edc:mask="0x1" edc:name="RH13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860730" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="LATH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff3773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------xx-xxx-xxx--xx" edc:name="LATH" edc:nzwidth="0x20" edc:por="------------------xx-xxx-xxx--xx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATH0" edc:desc="" edc:mask="0x1" edc:name="LATH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH1" edc:desc="" edc:mask="0x1" edc:name="LATH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATH4" edc:desc="" edc:mask="0x1" edc:name="LATH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH5" edc:desc="" edc:mask="0x1" edc:name="LATH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH6" edc:desc="" edc:mask="0x1" edc:name="LATH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATH8" edc:desc="" edc:mask="0x1" edc:name="LATH8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATH9" edc:desc="" edc:mask="0x1" edc:name="LATH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATH10" edc:desc="" edc:mask="0x1" edc:name="LATH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATH12" edc:desc="" edc:mask="0x1" edc:name="LATH12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATH13" edc:desc="" edc:mask="0x1" edc:name="LATH13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860740" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="ODCH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff3773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-000-000--00" edc:name="ODCH" edc:nzwidth="0x20" edc:por="------------------00-000-000--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCH0" edc:desc="" edc:mask="0x1" edc:name="ODCH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH1" edc:desc="" edc:mask="0x1" edc:name="ODCH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCH4" edc:desc="" edc:mask="0x1" edc:name="ODCH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH5" edc:desc="" edc:mask="0x1" edc:name="ODCH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH6" edc:desc="" edc:mask="0x1" edc:name="ODCH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCH8" edc:desc="" edc:mask="0x1" edc:name="ODCH8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCH9" edc:desc="" edc:mask="0x1" edc:name="ODCH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCH10" edc:desc="" edc:mask="0x1" edc:name="ODCH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCH12" edc:desc="" edc:mask="0x1" edc:name="ODCH12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCH13" edc:desc="" edc:mask="0x1" edc:name="ODCH13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860750" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="CNPUH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff3773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-000-000--00" edc:name="CNPUH" edc:nzwidth="0x20" edc:por="------------------00-000-000--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUH0" edc:desc="" edc:mask="0x1" edc:name="CNPUH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH1" edc:desc="" edc:mask="0x1" edc:name="CNPUH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUH4" edc:desc="" edc:mask="0x1" edc:name="CNPUH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH5" edc:desc="" edc:mask="0x1" edc:name="CNPUH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH6" edc:desc="" edc:mask="0x1" edc:name="CNPUH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUH8" edc:desc="" edc:mask="0x1" edc:name="CNPUH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH9" edc:desc="" edc:mask="0x1" edc:name="CNPUH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH10" edc:desc="" edc:mask="0x1" edc:name="CNPUH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUH12" edc:desc="" edc:mask="0x1" edc:name="CNPUH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH13" edc:desc="" edc:mask="0x1" edc:name="CNPUH13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860760" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="CNPDH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff3773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-000-000--00" edc:name="CNPDH" edc:nzwidth="0x20" edc:por="------------------00-000-000--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDH0" edc:desc="" edc:mask="0x1" edc:name="CNPDH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH1" edc:desc="" edc:mask="0x1" edc:name="CNPDH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDH4" edc:desc="" edc:mask="0x1" edc:name="CNPDH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH5" edc:desc="" edc:mask="0x1" edc:name="CNPDH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH6" edc:desc="" edc:mask="0x1" edc:name="CNPDH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDH8" edc:desc="" edc:mask="0x1" edc:name="CNPDH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH9" edc:desc="" edc:mask="0x1" edc:name="CNPDH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH10" edc:desc="" edc:mask="0x1" edc:name="CNPDH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDH12" edc:desc="" edc:mask="0x1" edc:name="CNPDH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH13" edc:desc="" edc:mask="0x1" edc:name="CNPDH13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860770" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------n---n-----------" edc:cname="CNCONH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONH" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE H" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860780" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="CNENH" edc:desc="" edc:grp="PORTH" edc:impl="0xffc03773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-000-000--00" edc:name="CNENH" edc:nzwidth="0x20" edc:por="------------------00-000-000--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEH0" edc:desc="" edc:mask="0x1" edc:name="CNIEH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH1" edc:desc="" edc:mask="0x1" edc:name="CNIEH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEH4" edc:desc="" edc:mask="0x1" edc:name="CNIEH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH5" edc:desc="" edc:mask="0x1" edc:name="CNIEH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH6" edc:desc="" edc:mask="0x1" edc:name="CNIEH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEH8" edc:desc="" edc:mask="0x1" edc:name="CNIEH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH9" edc:desc="" edc:mask="0x1" edc:name="CNIEH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH10" edc:desc="" edc:mask="0x1" edc:name="CNIEH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEH12" edc:desc="" edc:mask="0x1" edc:name="CNIEH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH13" edc:desc="" edc:mask="0x1" edc:name="CNIEH13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
