Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ1024EFG124.PIC
      <edc:SFRDef edc:_addr="0x1F860830" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn---n-nnn" edc:cname="LATJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff0b17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------x-xx---x-xxx" edc:name="LATJ" edc:nzwidth="0x20" edc:por="--------------------x-xx---x-xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATJ0" edc:desc="" edc:mask="0x1" edc:name="LATJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ1" edc:desc="" edc:mask="0x1" edc:name="LATJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATJ2" edc:desc="" edc:mask="0x1" edc:name="LATJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATJ4" edc:desc="" edc:mask="0x1" edc:name="LATJ4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATJ8" edc:desc="" edc:mask="0x1" edc:name="LATJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATJ9" edc:desc="" edc:mask="0x1" edc:name="LATJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATJ11" edc:desc="" edc:mask="0x1" edc:name="LATJ11" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860840" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn---n-nnn" edc:cname="ODCJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff0b17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-00---0-000" edc:name="ODCJ" edc:nzwidth="0x20" edc:por="--------------------0-00---0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCJ0" edc:desc="" edc:mask="0x1" edc:name="ODCJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ1" edc:desc="" edc:mask="0x1" edc:name="ODCJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCJ2" edc:desc="" edc:mask="0x1" edc:name="ODCJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ4" edc:desc="" edc:mask="0x1" edc:name="ODCJ4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ8" edc:desc="" edc:mask="0x1" edc:name="ODCJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ9" edc:desc="" edc:mask="0x1" edc:name="ODCJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCJ11" edc:desc="" edc:mask="0x1" edc:name="ODCJ11" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860850" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn---n-nnn" edc:cname="CNPUJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff0b17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-00---0-000" edc:name="CNPUJ" edc:nzwidth="0x20" edc:por="--------------------0-00---0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUJ0" edc:desc="" edc:mask="0x1" edc:name="CNPUJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ1" edc:desc="" edc:mask="0x1" edc:name="CNPUJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ2" edc:desc="" edc:mask="0x1" edc:name="CNPUJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ4" edc:desc="" edc:mask="0x1" edc:name="CNPUJ4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ8" edc:desc="" edc:mask="0x1" edc:name="CNPUJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ9" edc:desc="" edc:mask="0x1" edc:name="CNPUJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUJ11" edc:desc="" edc:mask="0x1" edc:name="CNPUJ11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860860" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn---n-nnn" edc:cname="CNPDJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff0b17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-00---0-000" edc:name="CNPDJ" edc:nzwidth="0x20" edc:por="--------------------0-00---0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDJ0" edc:desc="" edc:mask="0x1" edc:name="CNPDJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ1" edc:desc="" edc:mask="0x1" edc:name="CNPDJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ2" edc:desc="" edc:mask="0x1" edc:name="CNPDJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ4" edc:desc="" edc:mask="0x1" edc:name="CNPDJ4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ8" edc:desc="" edc:mask="0x1" edc:name="CNPDJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ9" edc:desc="" edc:mask="0x1" edc:name="CNPDJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDJ11" edc:desc="" edc:mask="0x1" edc:name="CNPDJ11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
