Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ1024EFG124.PIC
      <edc:SFRDef edc:_addr="0x1F860870" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------n---n-----------" edc:cname="CNCONJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONJ" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE J" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860880" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn---n-nnn" edc:cname="CNENJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffc00b17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-00---0-000" edc:name="CNENJ" edc:nzwidth="0x20" edc:por="--------------------0-00---0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEJ0" edc:desc="" edc:mask="0x1" edc:name="CNIEJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ1" edc:desc="" edc:mask="0x1" edc:name="CNIEJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ2" edc:desc="" edc:mask="0x1" edc:name="CNIEJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ4" edc:desc="" edc:mask="0x1" edc:name="CNIEJ4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ8" edc:desc="" edc:mask="0x1" edc:name="CNIEJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ9" edc:desc="" edc:mask="0x1" edc:name="CNIEJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEJ11" edc:desc="" edc:mask="0x1" edc:name="CNIEJ11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860890" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-n---n-nnnn" edc:cname="CNSTATJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff0a2f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-0---0-0000" edc:name="CNSTATJ" edc:nzwidth="0x20" edc:por="--------------------0-0---0-0000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATJ0" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ1" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ2" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ3" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ5" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ9" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATJ11" edc:desc="" edc:mask="0x1" edc:name="CNSTATJ11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8608A0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn---n-nnn" edc:cname="CNNEJ" edc:desc="" edc:impl="0xb17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-00---0-000" edc:name="CNNEJ" edc:nzwidth="32" edc:por="--------------------0-00---0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEJ0" edc:mask="0x1" edc:name="CNNEJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ1" edc:mask="0x1" edc:name="CNNEJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ2" edc:mask="0x1" edc:name="CNNEJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ4" edc:mask="0x1" edc:name="CNNEJ4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ8" edc:mask="0x1" edc:name="CNNEJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ9" edc:mask="0x1" edc:name="CNNEJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEJ11" edc:mask="0x1" edc:name="CNNEJ11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8608B0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn---n-nnn" edc:cname="CNFJ" edc:desc="" edc:impl="0xb17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0-00---0-000" edc:name="CNFJ" edc:nzwidth="32" edc:por="--------------------0-00---0-000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFJ0" edc:mask="0x1" edc:name="CNFJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ1" edc:mask="0x1" edc:name="CNFJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ2" edc:mask="0x1" edc:name="CNFJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFJ4" edc:mask="0x1" edc:name="CNFJ4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFJ8" edc:mask="0x1" edc:name="CNFJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ9" edc:mask="0x1" edc:name="CNFJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFJ11" edc:mask="0x1" edc:name="CNFJ11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f880000" edc:endaddr="0x1f885000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb5_std">
      <edc:AdjustPoint edc:_addr="0x1F880000" edc:offset="0x2000"/>
      <edc:SFRDef edc:_addr="0x1F882000" edc:_begin="0x0" edc:_end="0xf0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnn---nnn--n---n" edc:cname="ETHCON1" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000xxx000xx0xxx0" edc:name="ETHCON1" edc:nzwidth="0x20" edc:por="0000000000000000000xxx000xx0xxx0" edc:portals="CLR SET INV" ltx:baseofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUFCDEC" edc:desc="" edc:mask="0x1" edc:name="BUFCDEC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="MANFC" edc:desc="" edc:mask="0x1" edc:name="MANFC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="AUTOFC" edc:desc="" edc:mask="0x1" edc:name="AUTOFC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="" edc:mask="0x1" edc:name="RXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRTS" edc:desc="" edc:mask="0x1" edc:name="TXRTS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTV" edc:desc="" edc:mask="0xffff" edc:name="PTV" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ETHERNET CONTROLLER" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F882010" edc:_begin="0x0" edc:_end="0xf0" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="---------------------nnnnnnn----" edc:cname="ETHCON2" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxx0000000xxxx" edc:name="ETHCON2" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxx0000000xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="RXBUF_SZ" edc:desc="" edc:mask="0x7f" edc:name="RXBUF_SZ" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
